Examinator/src/InformationRegisters/ГруппыОбъектовСУЗ/ГруппыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПлеерКурсовВебКабинетаСУЗ/ПлеерКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлеерКурсовВебКабинетаСУЗ</name>
  <resources>
    <name>Плеер</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыПубликацийЭлектронныхРесурсовСУЗ/ТипыПубликацийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПубликацийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCORM_1_3</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПоставщикиСУЗ/ПоставщикиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоставщикиСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ПодборкиСУЗ/ПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрезентация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификационнаяГруппировка</name>
    <type>
      <types>CatalogRef.КлассификационныеГруппировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтартовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементов</name>
    <type>
      <types>EnumRef.ВариантыПредставленияЭлементовПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвернутьРазделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НумероватьСтраницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеТестаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Презентация</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ГлоссарииСУЗ/ГлоссарииСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГлоссарииСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьАлфавит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСОпределением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/CommonModules/РазработкаСУЗ/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩЕЕ ДЛЯ ФОРМ И ОБЪЕКТОВ РЕДАКТОРА

// Получает таблицу доступности данных поставщика
//
Функция ПолучитьТаблицуДоступностиДанныхПоставщика() Экспорт
	
	ТаблицаДоступностиДанныхПоставщика = Новый ТаблицаЗначений();
	ТаблицаДоступностиДанныхПоставщика.Колонки.Добавить("ЭлементФормы");
	ТаблицаДоступностиДанныхПоставщика.Колонки.Добавить("Свойство");
	ТаблицаДоступностиДанныхПоставщика.Колонки.Добавить("Значение");
	ТаблицаДоступностиДанныхПоставщика.Колонки.Добавить("Выполнить");
	
	Возврат ТаблицаДоступностиДанныхПоставщика;
	
КонецФункции

Функция ПолучитьПредпочитаемогоПоставщика() Экспорт
	
	Если Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить() Тогда
		Возврат Константы.ПредпочитатьПоставщикаСУЗ.Получить();
	Иначе
		Возврат Справочники.ПоставщикиСУЗ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Устанавливает доступность элементов формы, которые
// запрещено редактировать, так как они созданы сторонним поставщиком.
//
Процедура УстановитьДоступностьДанныхОтПоставщика(Форма, ТаблицаДоступностиДанныхПоставщика = Неопределено, ЕстьВерсии = Ложь, ИмяРеквизитаСДанными = "Объект") Экспорт
	
	// Примечание: вызывается перед "ЗагрузитьВерсию()" и после "УстановитьДоступностьЭлементовФормы()"
	
	Если НЕ Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ИзменятьДанныеТолькоПредпочитаемогоПоставщикаСУЗ.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма[ИмяРеквизитаСДанными].Поставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить() Тогда
		Если ЕстьВерсии Тогда
			Если ОбъектыСУЗ.СуществуютВерсииДругихПоставщиков(Форма[ИмяРеквизитаСДанными].Ссылка, Форма[ИмяРеквизитаСДанными].Поставщик) Тогда
				ПолноеИзменениеДоступно = Ложь;
			Иначе
				ПолноеИзменениеДоступно = Истина;
			КонецЕсли;
		Иначе		
			ПолноеИзменениеДоступно = Истина;
		КонецЕсли;
	Иначе
		ПолноеИзменениеДоступно = Ложь;
	КонецЕсли;
	
	Если ПолноеИзменениеДоступно Тогда
		Возврат;
	КонецЕсли;
	
	// Делаем все не доступными
	
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		
		// Возможные типы элементов:
		// ГруппаФормы, ДекорацияФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы,
		
		Если ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы.ТолькоПросмотр = Истина;
				
	КонецЦикла;
	
	Если ТаблицаДоступностиДанныхПоставщика <> Неопределено Тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаДоступностиДанныхПоставщика Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы["Значение"]) Тогда
				СтрокаТаблицы.ЭлементФормы[СтрокаТаблицы.Свойство] = СтрокаТаблицы["Значение"];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает предпочитаемого поставщика.
// Обычно используется при создании нового объекта
// СУЗ в форме элемента справочника.
//
// Параметры
//  ОбъектСУЗ  – Объект элемента справочника.
//
Процедура УстановитьПредпочитаемогоПоставщика(Объект) Экспорт
	
	// Если объект уже записан в базу, то выходим.
	
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		
		Если Объект.Свойство("Ссылка") И НЕ Объект.Ссылка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		Если Объект.Свойство("ИсходныйКлючЗаписи") И НЕ Объект.ИсходныйКлючЗаписи.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Объект.Поставщик = ПолучитьПредпочитаемогоПоставщика();

КонецПроцедуры // УстановитьПредпочитаемогоПоставщика()

Процедура ПереименоватьАвтоРодителей(Объект) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОбъектовСУЗ.Группа КАК Группа
		|ИЗ
		|	РегистрСведений.ГруппыОбъектовСУЗ КАК ГруппыОбъектовСУЗ
		|ГДЕ
		|	ГруппыОбъектовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
		|	И ГруппыОбъектовСУЗ.Группа.Наименование <> &Наименование";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Объект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГруппаОбъект = ВыборкаДетальныеЗаписи.Группа.ПолучитьОбъект();
		ГруппаОбъект.Наименование = Объект.Наименование;
		ГруппаОбъект.Записать();
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура устанавливает реквизит "Родитель" для нового элемента.
//
Процедура УстановитьРодителяНовогоОбъекта(Объект, Параметры, ИмяСправочника) Экспорт
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Подборка") И ЗначениеЗаполнено(Параметры.Подборка) Тогда
		
		Если Параметры.Свойство("ЭлектронныйРесурс") И ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
			Объект.Родитель = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Подборка, ИмяСправочника, Параметры.ЭлектронныйРесурс);
		Иначе
			Объект.Родитель = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Подборка, ИмяСправочника);
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ЭлектронныйРесурс") И ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		
		Объект.Родитель = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Параметры.ЭлектронныйРесурс, ИмяСправочника);
		
	ИначеЕсли Параметры.Свойство("Глоссарий") И ЗначениеЗаполнено(Параметры.Глоссарий) Тогда
		
		Если Параметры.Свойство("ЭлектронныйРесурс") И ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
			Объект.Родитель = Справочники.ГлоссарииСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Глоссарий, ИмяСправочника, Параметры.ЭлектронныйРесурс);
		Иначе
			Объект.Родитель = Справочники.ГлоссарииСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Глоссарий, ИмяСправочника);
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоступностьКомандРеквизитаСУЗ(Форма, ИмяРеквизита) Экспорт
	
	Если ЗначениеЗаполнено(Форма.Объект[ИмяРеквизита]) Тогда
		Форма.Элементы[ИмяРеквизита + "Создать"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "ДобавитьИзРанееСозданных"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "Редактировать"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "Удалить"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "НайтиВСписке"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "Декорация"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "Очистить"].Видимость = Истина;
	Иначе
		Форма.Элементы[ИмяРеквизита + "Создать"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "ДобавитьИзРанееСозданных"].Видимость = Истина;
		Форма.Элементы[ИмяРеквизита + "Редактировать"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "Удалить"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "НайтиВСписке"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "Декорация"].Видимость = Ложь;
		Форма.Элементы[ИмяРеквизита + "Очистить"].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЭлементПослеЗаписи(ЭлементыДляУдаления) Экспорт
	
	Для каждого Строка Из ЭлементыДляУдаления Цикл
		ОбщегоНазначенияСУ.УдалитьЭлементСправочника(Строка.Элемент);
	КонецЦикла;
	
	ЭлементыДляУдаления.Очистить();	
	
КонецПроцедуры

Процедура УстановитьДоступностьРедактора(Форма) Экспорт
	
	Если Форма.Объект.ИспользуетсяФорматированныйДокумент Тогда
		
		Форма.Элементы.ТекстовыйДокумент.Видимость             = Ложь;
		Форма.Элементы.ГруппаФорматированныйДокумент.Видимость = Истина;
		
	Иначе
		
		Форма.Элементы.ТекстовыйДокумент.Видимость             = Истина;
		Форма.Элементы.ГруппаФорматированныйДокумент.Видимость = Ложь;		
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПереместитьЭлемент(Направление, Элемент) Экспорт
	
	ДанныеЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Элемент, "Код, Родитель, Владелец");
	
	// Ищем соседний элемент
	
	ИмяТаблицы = Элемент.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаЭлемента.Ссылка,
		|	ТаблицаЭлемента.Код
		|ИЗ
		|	Справочник."+ИмяТаблицы+" КАК ТаблицаЭлемента
		|ГДЕ
		|	ТаблицаЭлемента.Родитель = &Родитель
		|	И ТаблицаЭлемента.Код "+?(Направление = "Вверх", "<=", ">=")+" &Код
		|   И ТаблицаЭлемента.Владелец = &Владелец
		|   И ТаблицаЭлемента.ПометкаУдаления = ЛОЖЬ
		|   И ТаблицаЭлемента.Ссылка <> &Элемент
		| УПОРЯДОЧИТЬ ПО Код "+?(Направление = "Вверх", "УБЫВ", "")+"";

	Запрос.УстановитьПараметр("Код", ДанныеЭлемента.Код);
	Запрос.УстановитьПараметр("Родитель", ДанныеЭлемента.Родитель);
	Запрос.УстановитьПараметр("Владелец", ДанныеЭлемента.Владелец);
	Запрос.УстановитьПараметр("Элемент", Элемент);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	СоседнийЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	
	//
	
	НовыйКодЭлемента = ВыборкаДетальныеЗаписи.Код;
	НовыйКодСоседнегоЭлемента = ДанныеЭлемента.Код;
	
	Если НовыйКодЭлемента = НовыйКодСоседнегоЭлемента Тогда
		
		Если Направление = "Вверх" Тогда
			НовыйКодЭлемента = НовыйКодЭлемента + 1;
		Иначе
			НовыйКодСоседнегоЭлемента = НовыйКодСоседнегоЭлемента + 1;
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	СоседнийЭлементОбъект = СоседнийЭлемент.ПолучитьОбъект();
	СоседнийЭлементОбъект.Код = НовыйКодСоседнегоЭлемента;
	СоседнийЭлементОбъект.Записать();
	
	ЭлементОбъект     = Элемент.ПолучитьОбъект();
	ЭлементОбъект.Код = НовыйКодЭлемента;
	ЭлементОбъект.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СкопироватьЭлементыСодержания(Знач ЭлектронныйРесурс, Знач МассивЭлементовСодержания, Знач Группа, МассивСкопированных=Неопределено) Экспорт
	
	Если МассивСкопированных = Неопределено Тогда
		МассивСкопированных = Новый Массив;
	КонецЕсли;
	
	Для каждого ЭлементСодержания Из МассивЭлементовСодержания Цикл
		
		// Делаем проверки
		
		Если ТипЗнч(ЭлементСодержания) <> Тип("СправочникСсылка.СодержаниеСУЗ")
			ИЛИ НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если МассивСкопированных.Найти(ЭлементСодержания) = Неопределено Тогда
			МассивСкопированных.Добавить(ЭлементСодержания);
		Иначе
			Продолжить; // Уже был скопирован ранее
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Группа) Тогда
		
			ДанныеГруппы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Группа, "ЭтоГруппа, Родитель");
			
			Если НЕ ДанныеГруппы.ЭтоГруппа Тогда
				Группа = ДанныеГруппы.Родитель; 
			КонецЕсли;
			
		КонецЕсли;
		
		// Копируем элемент
		
		НовыйЭлементОбъект = ЭлементСодержания.Скопировать();
		НовыйЭлементОбъект.Владелец = ЭлектронныйРесурс;
		НовыйЭлементОбъект.Родитель = Группа;
		НовыйЭлементОбъект.Записать();
		
		// Копируем рекурсивно подчиненные элементы групп
		
		Если НовыйЭлементОбъект.ЭтоГруппа Тогда
			
			СозданнаяГруппаСсылка = НовыйЭлементОбъект.Ссылка;

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СодержаниеСУЗ.Ссылка
				|ИЗ
				|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
				|ГДЕ
				|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
				|	И СодержаниеСУЗ.Родитель = &Родитель";

			Запрос.УстановитьПараметр("Родитель", ЭлементСодержания);

			Результат = Запрос.Выполнить();

			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			МассивПодчиненныхЭлементов = Новый Массив();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				МассивПодчиненныхЭлементов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			КонецЦикла;

			СкопироватьЭлементыСодержания(ЭлектронныйРесурс, МассивПодчиненныхЭлементов, СозданнаяГруппаСсылка, МассивСкопированных); // Рекурсия			
			
		КонецЕсли;		
		
	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбновитьГиперссылкиОбъектаСУЗ(Владелец, Гиперссылки, Поставщик = Неопределено) Экспорт
	
	Если Поставщик = Неопределено Тогда
		Поставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Поставщик");
	КонецЕсли;
	
	// Получаем таблицу существующих ссылок объекта
	// в т.ч. и помеченные на удаление
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СсылкиОбъектовСУЗ.Ссылка,
		|	СсылкиОбъектовСУЗ.СсылкаНаОбъектСУЗ,
		|	СсылкиОбъектовСУЗ.ЭлементПодборки,
		|	СсылкиОбъектовСУЗ.ПометкаУдаления
		|ИЗ
		|	Справочник.СсылкиОбъектовСУЗ КАК СсылкиОбъектовСУЗ
		|ГДЕ
		|	СсылкиОбъектовСУЗ.Владелец = &Владелец";
		
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	ТаблицаСсылокОбъектаСУЗ = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСсылокОбъектаСУЗ.Колонки.Добавить("Актуально", Новый ОписаниеТипов("Булево"));
	
	Для каждого Гиперссылка Из Гиперссылки Цикл
		
		Если Лев(Гиперссылка, 11) = "javascript:"
			И СтрЧислоВхождений(Гиперссылка, "%22") = 2 Тогда
			
			Гиперссылка = Сред(Гиперссылка, Найти(Гиперссылка, "%22") + 3);			
			Гиперссылка = Лев(Гиперссылка, Найти(Гиперссылка, "%22") - 1);
			
			СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Гиперссылка);
			
		Иначе
			
			СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Гиперссылка);
			
		КонецЕсли;
		
		ИдентификаторОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id");
		ИмяОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
		ЦелевоеОкно = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "window");			
		
		Если ЗначениеЗаполнено(ИдентификаторОбъекта)
			И ЗначениеЗаполнено(ИмяОбъекта) Тогда
			
			СсылкаНаОбъектСУЗ = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, ИдентификаторОбъекта);
			
			Если НЕ ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаОбъектСУЗ) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементПодборки = Неопределено;
			
			Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
				
				НомерГруппыПодборки = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "numGroup");
				
				Если ЗначениеЗаполнено(НомерГруппыПодборки) Тогда
					ЭлементПодборки = Справочники.ПодборкиСУЗ.СтраницаПодборкиПоНомеру(СсылкаНаОбъектСУЗ, НомерГруппыПодборки);
				КонецЕсли;
				
				ИдентификаторГруппыПодборки = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "idGroup");
				
				Если ЗначениеЗаполнено(ИдентификаторГруппыПодборки) Тогда
					ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторГруппыПодборки));
				КонецЕсли;					
					
			КонецЕсли;				
			
			// Ищем ссылку в справочнике
			
			СтруктураПоиска = Новый Структура("СсылкаНаОбъектСУЗ", СсылкаНаОбъектСУЗ);
			
			Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
				СтруктураПоиска.Вставить("ЭлементПодборки", ЭлементПодборки);
			КонецЕсли;
			
			СтрокаСсылки = ТаблицаСсылокОбъектаСУЗ.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокаСсылки.Количество() = 0 Тогда
				
				СсылкаОбъект = Справочники.СсылкиОбъектовСУЗ.СоздатьЭлемент();
				
				СсылкаОбъект.Владелец = Владелец;
				СсылкаОбъект.Поставщик = Поставщик;
				СсылкаОбъект.СсылкаНаОбъектСУЗ = СсылкаНаОбъектСУЗ;
				СсылкаОбъект.ЭлементПодборки = ЭлементПодборки;
				
				Попытка
					СсылкаОбъект.ЦелевоеОкно = Перечисления.ЦелевыеОкнаДляСсылокСУЗ[ЦелевоеОкно];
				Исключение
					СсылкаОбъект.ЦелевоеОкно = Неопределено;
				КонецПопытки;					
				
				СсылкаОбъект.Записать();
				
				НоваяСтрока = ТаблицаСсылокОбъектаСУЗ.Добавить();
				НоваяСтрока.Ссылка = СсылкаОбъект.Ссылка;
				НоваяСтрока.СсылкаНаОбъектСУЗ = СсылкаНаОбъектСУЗ;
				НоваяСтрока.ЭлементПодборки = ЭлементПодборки;
				НоваяСтрока.Актуально = Истина;
				
			Иначе
				
				СтрокаСсылки[0].Актуально = Истина; // Уже есть запись о гиперссылки
				
				Если СтрокаСсылки[0].ПометкаУдаления = Истина Тогда // BUG булево
				
					СсылкаОбъект = СтрокаСсылки[0].Ссылка.ПолучитьОбъект(); 
					СсылкаОбъект.УстановитьПометкуУдаления(Ложь);
					
				КонецЕсли;
					
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаляем не актуальные элементы справочника
	//
	
	Для каждого Строка Из ТаблицаСсылокОбъектаСУЗ Цикл
	
		Если Строка.Актуально Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаОбъект = Строка.Ссылка.ПолучитьОбъект(); 
		СсылкаОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;			
	
КонецПроцедуры

Процедура ОбновитьГиперссылкиРесурса(Ресурс = Неопределено) Экспорт
	
	// Вызывается в т.ч. и фоновым заданием
	// Может использоваться для обновления ссылок всех ресурсов
	
	ТаблицаГиперссылок = Новый ТаблицаЗначений;
	ТаблицаГиперссылок.Колонки.Добавить("Ресурс");
	ТаблицаГиперссылок.Колонки.Добавить("Гиперссылки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФайлыСУЗ.Ссылка,
	               |	ФайлыСУЗ.Владелец КАК Ресурс,
	               |	ФайлыСУЗ.Поставщик,
	               |	ФайлыСУЗ.ТипФайла
	               |ИЗ
	               |	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
	               |ГДЕ
	               |	ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
	               |	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
	               |	И ФайлыСУЗ.ВнешнийФайл = ЛОЖЬ
	               |	И ((ФайлыСУЗ.ТипФайла = ЗНАЧЕНИЕ(Перечисление.ТипыФайловСУЗ.Default) И (ФайлыСУЗ.ИмяФайла ПОДОБНО ""%.html"" ИЛИ ФайлыСУЗ.ИмяФайла ПОДОБНО ""%.htm""))
	               |			ИЛИ ФайлыСУЗ.ТипФайла = ЗНАЧЕНИЕ(Перечисление.ТипыФайловСУЗ.Document))";	
				   
				   
				   
				   
	Если ЗначениеЗаполнено(Ресурс) Тогда
		
		Запрос.Текст = Запрос.Текст + " И ФайлыСУЗ.Владелец = &Ресурс";

		Запрос.Параметры.Вставить("Ресурс", Ресурс);
	   
	КонецЕсли;				   
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПутьКФайлуДляУдаления = "";
		ПутьКФайлуHTML = "";
		
		// Читаем файл HTML
		
		Если ВыборкаДетальныеЗаписи.ТипФайла = Перечисления.ТипыФайловСУЗ.Document Тогда
			
			ПутьКВременномуКаталогу = ПолучитьИмяВременногоФайла("");
			
			ПутьКФайлуДляУдаления = ПутьКВременномуКаталогу; 
			
			СоздатьКаталог(ПутьКВременномуКаталогу);
			
			ПутьКВременномуКаталогу = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогу);
			
			ПолноеИмяСохраняемогоФайла = ПутьКВременномуКаталогу + "document.zip";			
			
			ДвоичныеДанныеАрхива = ОбъектыСУЗ.ПолучитьДанные(ВыборкаДетальныеЗаписи.Ссылка, "HTML", Истина, "ДвоичныеДанные");
			
			ДвоичныеДанныеАрхива.Записать(ПолноеИмяСохраняемогоФайла);
			
			ФайлАрхива = Новый ЧтениеZIPФайла(ПолноеИмяСохраняемогоФайла);
			ФайлАрхива.ИзвлечьВсе(ПутьКВременномуКаталогу, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 				

			ПутьКФайлуHTML = РазработкаСУЗКлиентСервер.ПутьКФайлуЗапускаДокумента(ПутьКВременномуКаталогу);
			
			
		Иначе
			
			ПутьКВременномуФайлу = ПолучитьИмяВременногоФайла("html");
			
			ПутьКФайлуДляУдаления = ПутьКВременномуФайлу;
			
			ПутьКФайлуHTML = ПутьКВременномуФайлу;
			
			ДвоичныеДанные = ОбъектыСУЗ.ПолучитьДанные(ВыборкаДетальныеЗаписи.Ссылка, "ДвоичныеДанные", Истина, "ДвоичныеДанные");
			
			ДвоичныеДанные.Записать(ПутьКВременномуФайлу);			
			
		КонецЕсли;
		
		
		ЧтениеHTML = Новый ЧтениеHTML;
		ЧтениеHTML.ОткрытьФайл(ПутьКФайлуHTML);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
				
		Гиперссылки = ДокументHTML.ПолучитьЭлементыПоИмени("a");
			
		// Обрабатываем ссылки файла и записываем их в базу
		
		Для каждого ЭлементВебСсылки Из Гиперссылки Цикл
			
			СтрокаТаблица = ТаблицаГиперссылок.Найти(ВыборкаДетальныеЗаписи.Ресурс, "Ресурс");
			
			Если СтрокаТаблица = Неопределено Тогда
				
				СтрокаТаблица = ТаблицаГиперссылок.Добавить();
				СтрокаТаблица.Ресурс = ВыборкаДетальныеЗаписи.Ресурс;
				СтрокаТаблица.Гиперссылки = Новый Массив;
				
			КонецЕсли;
			
			Если СтрокаТаблица.Гиперссылки.Найти(ЭлементВебСсылки.Гиперссылка) = Неопределено Тогда
				СтрокаТаблица.Гиперссылки.Добавить(ЭлементВебСсылки.Гиперссылка);
			КонецЕсли;
			
		КонецЦикла;
		
		ЧтениеHTML.Закрыть();
		
		Попытка
			УдалитьФайлы(ПутьКФайлуДляУдаления);
		Исключение
		КонецПопытки;		
		
	КонецЦикла;		
	
	Для каждого Строка Из ТаблицаГиперссылок Цикл	
		РазработкаСУЗ.ОбновитьГиперссылкиОбъектаСУЗ(Строка.Ресурс, Строка.Гиперссылки);	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбновитьЗависимыеРесурсы(Ресурс, ЗависимыеРесурсы, ЗависимыеРесурсыДополняющиеAPI) Экспорт
	
	// Указываем зависимые ресурсы или удаляем лишние
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗависимыеРесурсыСУЗ.Ссылка,
		|	ЗависимыеРесурсыСУЗ.Ресурс КАК Ресурс
		|ИЗ
		|	Справочник.ЗависимыеРесурсыСУЗ КАК ЗависимыеРесурсыСУЗ
		|ГДЕ
		|	ЗависимыеРесурсыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ЗависимыеРесурсыСУЗ.Владелец = &Ресурс";

	Запрос.УстановитьПараметр("Ресурс", Ресурс);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();	
	
	Если ЗависимыеРесурсы <> Неопределено И ЗависимыеРесурсы.Количество() > 0 Тогда
		
		Для каждого ЗависимыйРесурс Из ЗависимыеРесурсы Цикл
			
			ВыборкаДетальныеЗаписи.Сбросить();
			
			Если ВыборкаДетальныеЗаписи.НайтиСледующий(ЗависимыйРесурс, "Ресурс") Тогда
				
				ЗависимыйРесурсОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
			Иначе
				
				ЗависимыйРесурсОбъект = Справочники.ЗависимыеРесурсыСУЗ.СоздатьЭлемент();
				
				ЗависимыйРесурсОбъект.Владелец     = Ресурс;
				ЗависимыйРесурсОбъект.Ресурс       = ЗависимыйРесурс;
				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЗависимыйРесурсОбъект);
				
				
			КонецЕсли;
			
			ЗависимыйРесурсОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗависимыйРесурс, "Наименование");
			
			Если ЗависимыеРесурсыДополняющиеAPI <> Неопределено
				И ЗависимыеРесурсыДополняющиеAPI.Найти(Строка(ЗависимыйРесурс.УникальныйИдентификатор())) <> Неопределено Тогда
				
				ЗависимыйРесурсОбъект.ДополняетAPI = Истина;
				
			Иначе
				
				ЗависимыйРесурсОбъект.ДополняетAPI = Ложь;
				
			КонецЕсли;
			
			ЗависимыйРесурсОбъект.Записать();
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗависимыеРесурсы = Неопределено
			ИЛИ ЗависимыеРесурсы.Количество() = 0
			ИЛИ ЗависимыеРесурсы.Найти(ВыборкаДетальныеЗаписи.Ресурс) = Неопределено Тогда
			
			ЗависимыйРесурсОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

			ЗависимыйРесурсОбъект.УстановитьПометкуУдаления(Истина);
			
			ЗависимыйРесурсОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;	
	
	
КонецПроцедуры

Функция ИспользоватьВстроенныйПлеерКурсовВебКабинета() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ВебКабинетСУ.Используется()
		И Константы.ИспользоватьВстроенныйПлеерКурсовВебКабинетаСУЗ.Получить();
КонецФункции

Процедура УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(Знач ЭлектронныйРесурс, МассивЭлементов, ЭтоНовыйЭлемент = Ложь) Экспорт
	
	УбратьВидимость = Ложь;
	
	Если ЭтоНовыйЭлемент И ИспользоватьВстроенныйПлеерКурсовВебКабинета() Тогда
		УбратьВидимость = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ЭлектронныйРесурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ")
		И РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		УбратьВидимость = Истина;
	КонецЕсли;
	
	Если УбратьВидимость Тогда
		Для каждого ЭлементФормы Из МассивЭлементов Цикл
			ЭлементФормы.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБМЕН ДАННЫМИ И ПУБЛИКАЦИИ

Функция ПолучитьЗначенияПеременнойИзФайлаExcel(ДанныеФайла, Колонки, Переменная, ОдноЗначение = Истина, АльтернативноеЗначение = Неопределено, Тип = Неопределено, Владелец = Неопределено) Экспорт
	
	МассивКолонок = Колонки.НайтиСтроки(Новый Структура("Значение", Переменная));
	
	МассивЗначений = Новый Массив();
	
	Для каждого Колонка Из МассивКолонок Цикл
	
		Значение = ДанныеФайла[Колонка.Номер - 1];
		
		Если ЗначениеЗаполнено(Тип) Тогда
		
			Если Тип = "Булево" Тогда
				
				Если Значение = "1"
					ИЛИ НРег(Значение) = "да"
					ИЛИ НРег(Значение) = "истина"
					ИЛИ НРег(Значение) = "true" Тогда
					
					Значение = Истина;
					
				КонецЕсли;	
				
				Если Значение = "0"
					ИЛИ НРег(Значение) = "нет"
					ИЛИ НРег(Значение) = "ложь"
					ИЛИ НРег(Значение) = "false" Тогда
					
					Значение = Ложь;
					
				КонецЕсли;
				
			ИначеЕсли Тип = "Число" Тогда
				
				Попытка
					Значение = Число(Значение);
				Исключение
					Значение = 0;
				КонецПопытки;
				
			Иначе // Ссылка
				
				Тип              = Тип(Тип);
				ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
				ПолноеИмя        = ОбъектМетаданных.ПолноеИмя(); // Например: Справочник.РубрикаторыСУЗ
				ПолноеИмяМассив  = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(ПолноеИмя, "."); // Первые элемент - тип объекта метаданных. Второй - его имя.
				
				Если ПолноеИмяМассив[0] = "Справочник" Тогда
					Значение = ОбщегоНазначенияСУ.НайтиЭлементСправочника(ПолноеИмяМассив[1], "Наименование", Значение, Владелец);
				КонецЕсли;
				
				Если ПолноеИмяМассив[0] = "Перечисление" Тогда
					
					Попытка
						Значение = Перечисления[ПолноеИмяМассив[1]][Значение];
					Исключение
						Значение = Перечисления[ПолноеИмяМассив[1]].ПустаяСсылка();
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Значение) Тогда
			МассивЗначений.Добавить(Значение);
		ИначеЕсли АльтернативноеЗначение <> Неопределено Тогда
			МассивЗначений.Добавить(АльтернативноеЗначение);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ОдноЗначение Тогда
		
		Если МассивЗначений.Количество() > 0 Тогда
			Возврат МассивЗначений[0];
		Иначе
			Возврат ?(АльтернативноеЗначение <> Неопределено, АльтернативноеЗначение, Неопределено); 
		КонецЕсли;
		
	Иначе
		
		Возврат МассивЗначений;
		
	КонецЕсли;

КонецФункции

Процедура НачатьЧтениеПакетаДанных(ЧтениеXML, Секция = "ЭлементыДляЗагрузки") Экспорт
	
	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.Имя = Секция 
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Прочитать();
	
КонецПроцедуры

Процедура ОпубликоватьПакетДанных(ПараметрыПубликации, АдресХранилища, АдресХранилищаДополнительный) Экспорт

	ОбработкаОбъект = Обработки.ПубликацияЭлектронныхРесурсовСУЗ.Создать();
	ОбработкаОбъект.ТипПубликации = ПараметрыПубликации.ТипПубликации;
	ОбработкаОбъект.Описание = ПараметрыПубликации.Описание;
	
	ОбработкаОбъект.УдалитьСтарыеПубликации = ПараметрыПубликации.УдалитьСтарыеПубликации;
	ОбработкаОбъект.ДляТестирования = ПараметрыПубликации.ДляТестирования;
	ОбработкаОбъект.СохранятьАктивность = ПараметрыПубликации.СохранятьАктивность;
	ОбработкаОбъект.ВключитьБраузер = ПараметрыПубликации.ВключитьБраузер;
	ОбработкаОбъект.ПредпочитатьФорматВидеоWEBM = ПараметрыПубликации.ПредпочитатьФорматВидеоWEBM;
	ОбработкаОбъект.КаталогДляСохранения = ПараметрыПубликации.КаталогДляСохранения;
	ОбработкаОбъект.ВключитьИнтерфейсПреподавателя = ПараметрыПубликации.ВключитьИнтерфейсПреподавателя;	
	ОбработкаОбъект.ПарольПользователя = ПараметрыПубликации.ПарольПользователя;
	ОбработкаОбъект.ПарольПреподавателя = ПараметрыПубликации.ПарольПреподавателя;
	
	ОбработкаОбъект.ПользовательскиеСтили = ПараметрыПубликации.ПользовательскиеСтили;
	ОбработкаОбъект.ЯзыкИнтерфейса = ПараметрыПубликации.ЯзыкИнтерфейса;	
	ОбработкаОбъект.ПоискРазрешен = ПараметрыПубликации.ПоискРазрешен;	
	
	НомерСтроки = 0;
	Для каждого ЭлектронныйРесурс Из ПараметрыПубликации.ЭлектронныеРесурсы Цикл	
		НоваяСтрока = ОбработкаОбъект.ЭлектронныеРесурсы.Добавить();
		НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
		НоваяСтрока.РазмещениеКнопкиВыхода = ПараметрыПубликации.РазмещениеКнопкиВыхода[НомерСтроки];
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;	
	
	Если ПараметрыПубликации.ТипПубликации = Перечисления.ТипыПубликацийЭлектронныхРесурсовСУЗ.WS Тогда		
		Результат = ОбработкаОбъект.ВыполнитьПубликацию(ПараметрыПубликации.УникальныйИдентификатор);		
	Иначе		
		Результат = ОбработкаОбъект.ВыполнитьПубликацию(АдресХранилищаДополнительный);		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВЕРСИИ ОБЪЕКТОВ

Функция ПоказатьКоличествоВерсийОбъектаНаФорме(Форма, Знач Объект, Знач ТипОбъекта = Неопределено) Экспорт
	                           
	Если ТипОбъекта <> Неопределено Тогда
		
		Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
			ТипОбъекта = Тип(ТипОбъекта);
		КонецЕсли;
		
		Объект = ДанныеФормыВЗначение(Объект, ТипОбъекта);
		
	КонецЕсли;
	
	НаборВерсий = ОбъектыСУЗ.ПолучитьНаборВерсий(Объект.Ссылка);
	
	КоличествоВерсий = НаборВерсий.Количество();
	
	Форма.Элементы.АрхивВерсий.Заголовок = "Архив (" + КоличествоВерсий + ")";
	
	Если КоличествоВерсий = 0 Тогда
		Форма.Элементы.АрхивВерсий.Доступность = Ложь;
	Иначе
		Форма.Элементы.АрхивВерсий.Доступность = Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает предпочитаемого поставщика в ИБ.
//
// Параметры
//  Нет.
//
Функция ПолучитьСтруктуруНовойВерсииОбъекта(Знач Объект, Знач ТипОбъекта) Экспорт
	
	Если Константы.ПоказыватьПоследнююВерсиюСУЗ.Получить() Тогда
		Поставщик = Константы.ПредпочитатьПоставщикаСУЗ.Получить();
	Иначе
		Поставщик = Справочники.ПоставщикиСУЗ.ПустаяСсылка();
	КонецЕсли;		
	
	Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
		ТипОбъекта = Тип(ТипОбъекта);
	КонецЕсли;
	
	ОбъектСУЗ = ДанныеФормыВЗначение(Объект, ТипОбъекта);
	
	Если НЕ ОбъектСУЗ.ЭтоНовый() Тогда
		
		// Ищем, есть ли другие версии от предпочитаемого поставщика.
		
		СтруктураПоследнейВерсии = ОбъектыСУЗ.ПолучитьПоследнююВерсию(ОбъектСУЗ.Ссылка, Поставщик);
		
		Если СтруктураПоследнейВерсии.Поставщик = Поставщик Тогда // Есть версии предпочитаемого поставщика.
			Версия = СтруктураПоследнейВерсии.Версия + 1;
		Иначе
			Версия = 1;
		КонецЕсли;
		
	Иначе
		
		Версия = 1;
		
	КонецЕсли;
	
	СтруктураВерсии = Новый Структура();
	
	СтруктураВерсии.Вставить("Версия", Версия);
	СтруктураВерсии.Вставить("Поставщик", Поставщик);		
	
	Возврат СтруктураВерсии;
	
КонецФункции // ПолучитьСтруктуруНовойВерсииОбъекта()

// Используется при загрузке новой версии данных в форму.
//
// Параметры
// 	Форма  - Форма, где размещен визуальный редактор.
//
Процедура УстановитьДанныеВерсииОбъекта(Форма, Объект, Знач ТипОбъекта, ПерваяЗагрузка) Экспорт
	
	ПоказатьКоличествоВерсийОбъектаНаФорме(Форма, Объект, ТипОбъекта);
	
	ВсеКнопкиДанных = Форма.Элементы.ИмяРедактируемыхДанных.СписокВыбора;
	
	Если Форма.Объект.ИспользуетсяФорматированныйДокумент Тогда
		ИмяДанных = "ФорматированныйДокумент";
	Иначе
		ИмяДанных = "ТекстовыеДанные";
	КонецЕсли;
	
	// Получаем данные версии из базы данных.
	Для каждого ТекКнопка Из ВсеКнопкиДанных Цикл
		
		ДанныеВерсии = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, ТекКнопка.Значение, Ложь, ИмяДанных, Объект.Поставщик, Объект.Версия);
		
		Если Форма.Объект.ИспользуетсяФорматированныйДокумент Тогда
			
			Форма[ТекКнопка.Значение] = ДанныеВерсии;
		
		Иначе
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент();
			ТекстовыйДокумент.УстановитьТекст(ДанныеВерсии);
			
			Форма[ТекКнопка.Значение] = ТекстовыйДокумент;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РазработкаСУЗКлиентСервер.УстановитьЗаголовокДоступныхДанныхВизуальногоРедактора(Форма); 	
	
	Если Форма.Объект.ИспользуетсяФорматированныйДокумент Тогда
		Форма.ФорматированныйДокумент = Форма[Форма.ИмяРедактируемыхДанных]; // Загружаем форматированный документ
	Иначе
		Форма.ТекстовыйДокумент = Форма[Форма.ИмяРедактируемыхДанных]; // Загружаем текстовый документ
	КонецЕсли;
	
	Форма.ИмяЗагруженныхДанных = Форма.ИмяРедактируемыхДанных; // Отмечаем, что данные загружены в визуальный редактор
	
	Если НЕ ПерваяЗагрузка Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
		
	Форма.Элементы.Поставщик.ТолькоПросмотр  = Истина;
	Форма.Элементы.Версия.ТолькоПросмотр     = Истина;
	Форма.Элементы.СоздатьВерсию.Доступность = Истина;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВерсииОбъектаСУЗ(Объект, Данные, КодДанных, ИмяРеквизита="ТекстовыеДанные", Поставщик=Неопределено, Версия=Неопределено, РасширениеФайла = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Поставщик = Неопределено Тогда
		Поставщик = Объект.Поставщик;
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Версия = Объект.Версия;
	КонецЕсли;	
	
	ИмяРегистраСДанными = ОбъектыСУЗ.ПолучитьИмяРегистраСДанными(Объект.Ссылка);
	НаборЗаписей = РегистрыСведений[ИмяРегистраСДанными].СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(Объект.Ссылка);
	НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
	НаборЗаписей.Отбор.Версия.Установить(Версия);
	НаборЗаписей.Отбор.КодДанных.Установить(КодДанных);

	НоваяЗапись = НаборЗаписей.Добавить();
	
	ДвоичныеДанныеДляЗаписи = Неопределено;
	
	Если ИмяРеквизита = "ВсеРеквизиты" Тогда
		
		Для каждого ЭлементДанных Из Данные Цикл
			
			Если ЭлементДанных.Ключ = "ДвоичныеДанные" И ТипЗнч(ЭлементДанных.Значение) = Тип("ДвоичныеДанные") Тогда
				ДвоичныеДанныеДляЗаписи = ПоместитьДанныеФайлаВХранилищеЗначения(Объект, ЭлементДанных.Значение);
			Иначе
		    	НоваяЗапись[ЭлементДанных.Ключ] = ЭлементДанных.Значение;
			КонецЕсли;			
		
		КонецЦикла;
		
	Иначе
		
		Если ИмяРеквизита = "ДвоичныеДанные" Тогда
			
			ДвоичныеДанныеДляЗаписи = ПоместитьДанныеФайлаВХранилищеЗначения(Объект, Данные);
			
		ИначеЕсли ИмяРеквизита = "ФорматированныйДокумент"  Тогда			
			
			НоваяЗапись[ИмяРеквизита] = Новый ХранилищеЗначения(Данные);
			
		Иначе			
			
			НоваяЗапись[ИмяРеквизита] = Данные;			
			
		КонецЕсли;
				
	КонецЕсли;
	
	НоваяЗапись.КодДанных = КодДанных;
	НоваяЗапись.СсылкаНаОбъектСУЗ =  Объект.Ссылка;
	НоваяЗапись.Поставщик = Поставщик;
	НоваяЗапись.Версия = Версия;
	
	НоваяЗапись.ДатаИзменения = ТекущаяДата();

	
	Если ДвоичныеДанныеДляЗаписи <> Неопределено Тогда
		
		Если ИмяРегистраСДанными <> "ДанныеФайлыСУЗ" Тогда		
			ВызватьИсключение НСтр("ru = 'Невозможно сохранить двоичные данные в данный объект'");
		КонецЕсли;
		
		Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video И ХранитьФайлыВБСП() Тогда
		
			// Помещаем двоичные данные в справочник БСП
			
			ПрисоединенныйФайл = РегистрыСведений.ДанныеФайлыСУЗ.ПрисоединенныйФайлЗаписи(НоваяЗапись.СсылкаНаОбъектСУЗ, НоваяЗапись.Поставщик, НоваяЗапись.Версия, НоваяЗапись.КодДанных);
			
			СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Объект.ИмяФайла, Ложь);
			
			Если РасширениеФайла = Неопределено Тогда
				РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураИмениФайла.Расширение);
			Иначе
				РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
			КонецЕсли;		
			
			Если ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда			
				
				ПрисоединенныеФайлы.ОбновитьПрисоединенныйФайл(
					ПрисоединенныйФайл, 
					Новый Структура(
						"АдресФайлаВоВременномХранилище, АдресВременногоХранилищаТекста, ИмяБезРасширения, ДатаМодификацииУниверсальная, Расширение",					
						ПоместитьВоВременноеХранилище(ДвоичныеДанныеДляЗаписи),
						"",
						СтруктураИмениФайла.ИмяБезРасширения,
						Объект.ДатаИзменения,
						РасширениеБезТочки
					)
				);
				
							
			Иначе
				
				ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(Объект.Ссылка, СтруктураИмениФайла.ИмяБезРасширения, РасширениеБезТочки, Объект.ДатаИзменения, Объект.ДатаИзменения, ПоместитьВоВременноеХранилище(ДвоичныеДанныеДляЗаписи));
				
			КонецЕсли;
			
			НоваяЗапись.ДвоичныеДанные = Неопределено;
			НоваяЗапись.ПрисоединенныйФайл = ПрисоединенныйФайл;
			
		Иначе
			
			НоваяЗапись.ДвоичныеДанные = Новый ХранилищеЗначения(ДвоичныеДанныеДляЗаписи);
			
		КонецЕсли;
			
		НоваяЗапись.РасширениеФайла = РасширениеБезТочки;
		
	КонецЕсли;
	
	
	НаборЗаписей.Записать();
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ФайлыСУЗ")
		И Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video
		И КодДанных = "ДвоичныеДанные" Тогда
		
		// Удаляем другие форматы видео при изменении основного
		
		ФорматыВидео = Справочники.ФайлыСУЗ.ДоступныеФорматыВидео();
		
		Для каждого Формат Из ФорматыВидео Цикл
			
			УдалитьДанныеВерсииОбъектаСУЗ(Объект, Формат, Поставщик, Версия);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДанныеВерсииОбъектаСУЗ(Объект, КодДанных, Поставщик=Неопределено, Версия=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка	
	
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Объект)) Тогда
			СсылкаНаОбъект = Объект;
		Иначе
			СсылкаНаОбъект = Объект.Ссылка;
		КонецЕсли;
		
		Если Поставщик = Неопределено Тогда
			Поставщик = Объект.Поставщик;
		КонецЕсли;
		
		Если Версия = Неопределено Тогда
			Версия = Объект.Версия;
		КонецЕсли;	
		
		ИмяРегистраСДанными = ОбъектыСУЗ.ПолучитьИмяРегистраСДанными(СсылкаНаОбъект);
		НаборЗаписей = РегистрыСведений[ИмяРегистраСДанными].СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъект);
		НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
		НаборЗаписей.Отбор.Версия.Установить(Версия);
		НаборЗаписей.Отбор.КодДанных.Установить(КодДанных);
		
		Если ИмяРегистраСДанными = "ДанныеФайлыСУЗ" Тогда
			
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
			
				Если ЗначениеЗаполнено(Запись.ПрисоединенныйФайл) Тогда
					ПрисоединенныйФайлОбъект = Запись.ПрисоединенныйФайл.ПолучитьОбъект();
					ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина, Истина);
				КонецЕсли;			
			
			КонецЦикла;
			
			НаборЗаписей.Очистить();
			
		КонецЕсли;		
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;

	КонецПопытки;
		
		
КонецПроцедуры

Функция ВерсияСуществуетВБазеДанных(Знач Объект, Знач ТипОбъекта) Экспорт
	
	Если ТипЗнч(ТипОбъекта) = Тип("Строка") Тогда
		ТипОбъекта = Тип(ТипОбъекта);
	КонецЕсли;
	
	Объект = ДанныеФормыВЗначение(Объект, ТипОбъекта);
	
	ИмяРегистраСДанными = ОбъектыСУЗ.ПолучитьИмяРегистраСДанными(Объект.Ссылка);
	НаборВерсий = РегистрыСведений[ИмяРегистраСДанными].СоздатьНаборЗаписей();
	НаборВерсий.Отбор.СсылкаНаОбъектСУЗ.Установить(Объект.Ссылка);
	НаборВерсий.Отбор.КодДанных.Установить("Описание");
	НаборВерсий.Отбор.Поставщик.Установить(Объект.Поставщик);
	НаборВерсий.Отбор.Версия.Установить(Объект.Версия);
	НаборВерсий.Прочитать();

	Если НаборВерсий.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФАЙЛЫ И РЕСУРСЫ

// Общее

Функция ХранитьФайлыВБСП() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ХранитьФайлыВидеоВТомахСУЗ.Получить();
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

// Сохраняет содержимое файла в базу данных
//
Процедура СохранитьДвоичныеДанныеФайла(ФайлОбъект, ДвоичныеДанные) Экспорт
	
	Если ФайлОбъект.ТипФайла = Перечисления.ТипыФайловСУЗ.Default Тогда 
	
		// Извлекаем текст файла
		
		ТекстФайла = ОбщегоНазначенияСУ.ИзвлечьТекстИзДвоичныхДанных(ДвоичныеДанные, ОбщегоНазначенияСУКлиентСервер.РасширениеИмениФайла(ФайлОбъект.ИмяФайла));
		
	КонецЕсли;
	
	// Сохраняем двоичные данные
	
	Если ЗначениеЗаполнено(ТекстФайла) Тогда
		
		ДанныеДляСохранения = Новый Структура;
		ДанныеДляСохранения.Вставить("ТекстовыеДанные", ТекстФайла);
		ДанныеДляСохранения.Вставить("ДвоичныеДанные", ДвоичныеДанные);
		
		ИмяРеквизитаДляСохранения = "ВсеРеквизиты";
		
	Иначе
		
		ДанныеДляСохранения       = ДвоичныеДанные;
		ИмяРеквизитаДляСохранения = "ДвоичныеДанные";
		
	КонецЕсли;
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ФайлОбъект, ДанныеДляСохранения, "ДвоичныеДанные", ИмяРеквизитаДляСохранения);
	
КонецПроцедуры

// Определяет, является файл HTML
Функция ЭтоФайлHTML(Знач Расширение) Экспорт
	
	Расширение = СтрЗаменить(Расширение, ".", "");
	
	Если НРег(Расширение) = "htm" ИЛИ НРег(Расширение) = "html" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Подготавливает двоичные данные для сохранения в базу.
//
Функция ПоместитьДанныеФайлаВХранилищеЗначения(Объект, ДвоичныеДанные)
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		
		МаксимальныйРазмерФайла = РазработкаСУЗПовтИсп.ПолучитьМаксимальныйРазмерФайла();
		Загрузка                = Ложь;
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.ФайлыСУЗ") Тогда
			Загрузка = Объект.ОбменДанными.Загрузка;
		КонецЕсли;
		
		Если МаксимальныйРазмерФайла > 0 И НЕ Загрузка Тогда
			
			РазмерФайла = ДвоичныеДанные.Размер(); 
			
			Если РазмерФайла > МаксимальныйРазмерФайла Тогда
				
				ВызватьИсключение ПолучитьТекстОПревышенииРазмераФайла(Объект.Наименование, РазмерФайла, МаксимальныйРазмерФайла);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неверный формат двоичных данных'");
		
	КонецЕсли;		
		
	Возврат ДвоичныеДанные; 
	
КонецФункции

// Получает текст предупреждения, если размер файла превышает допустимый.
//
Функция ПолучитьТекстОПревышенииРазмераФайла(ИмяФайла, РазмерФайла, МаксимальныйРазмерФайла)
	
	РазмерВМб = РазмерФайла / (1024 * 1024);
	РазмерВМбМакс = МаксимальныйРазмерФайла / (1024 * 1024);

	ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Размер файла ""%1"" (%2 Мб) превышает максимально допустимый (%3 Мб)'"),
		ИмяФайла,
		?(РазмерВМб >= 1, Формат(РазмерВМб, "ЧДЦ=0"), Формат(РазмерВМб, "ЧДЦ=1; ЧН=0")),
		?(РазмерВМбМакс >= 1, Формат(РазмерВМбМакс, "ЧДЦ=0"), Формат(РазмерВМбМакс, "ЧДЦ=1; ЧН=0")));
	
	Возврат ТекстИсключения;
	
КонецФункции

Процедура РазметитьПолеРедактированияНастройкиИнтерактивногоРесурса(Форма, ОписаниеТипов) Экспорт
	
	// Получаем тип
	
	Типы = ОписаниеТипов.Типы();
	
	Если Типы.Количество() = 1 Тогда		
		ТипНастройки = Типы[0];		
	Иначе		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество типов значения настройки должно быть равным одному'"));
		Возврат;		
	КонецЕсли;
	
	// Создаем новый реквизит или обновляем существующий

	РеквизитыФормы       = Форма.ПолучитьРеквизиты();
	ДобавляемыеРеквизиты = Новый Массив();
	Удаляемыереквизиты   = Новый Массив();

	Для каждого РеквизитФормы Из РеквизитыФормы Цикл

		Если РеквизитФормы.Имя = "ЗначениеНастройки" Тогда
			Удаляемыереквизиты.Добавить("ЗначениеНастройки");
			Прервать;
		КонецЕсли;

	КонецЦикла;

	НовыйРеквизит = Новый РеквизитФормы("ЗначениеНастройки",
								   ОписаниеТипов,
								   "",
								   НСтр("ru = 'Значение настройки'"),
								   Истина); 
								   
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);

	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, Удаляемыереквизиты);
   
	// Создаем элемент формы

	ЭлементФормы = Форма.Элементы.Найти("ЗначениеНастройки");

	Если ЭлементФормы = Неопределено Тогда

		ЭлементФормы = Форма.Элементы.Добавить("ЗначениеНастройки",
										 Тип("ПолеФормы"),
										 Форма.Элементы.ГруппаЗначениеНастройки); 	
										 
		ЭлементФормы.ПутьКДанным    = "ЗначениеНастройки";
		
	КонецЕсли;
										 
	ЭлементФормы.Вид                      = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок                = "Значение настройки";
	ЭлементФормы.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементФормы.МногострочныйРежим       = ?(ТипНастройки = Тип("Строка") И ОписаниеТипов.КвалификаторыСтроки.Длина = 0, Истина, Ложь);
    ЭлементФормы.РастягиватьПоГоризонтали = Истина;


КонецПроцедуры

// Документы

Функция ПользовательскиеШаблоныДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныДокументовСУЗ.ИмяФайла,
		|	ШаблоныДокументовСУЗ.ДатаИзменения,
		|	ШаблоныДокументовСУЗ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныДокументовСУЗ КАК ШаблоныДокументовСУЗ
		|ГДЕ
		|	ШаблоныДокументовСУЗ.ПометкаУдаления = ЛОЖЬ";
	
	Возврат ОбщегоНазначенияСУ.ТаблицаВФиксированныйМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ОписаниеДокумента(НастройкиКартинок) Экспорт
	
	ТекстОписания = "";
	
	Если НастройкиКартинок <> Неопределено И НастройкиКартинок.Свойство("СерииКартинок") И НастройкиКартинок.СерииКартинок.Количество() > 0 Тогда
					
		ТекстОписания = ТекстОписания + "{{IMAGES>" + Символы.ПС;

		КартинкиXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Картинки"));
		
		КартинкиXDTO.ВариантЗагрузкиКартинок = НастройкиКартинок.ВариантЗагрузкиКартинок;
		
		СерияКартинокXDTOТип = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "СерияКартинок");
		КартинкаXDTOТип      = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/ImportFilesSettings", "Картинка");
		
		Для каждого Строка Из НастройкиКартинок.СерииКартинок Цикл
		
			СерияКартинокXDTO = ФабрикаXDTO.Создать(СерияКартинокXDTOТип);	
			
			СерияКартинокXDTO.Имя = Строка.Имя;
			
			Для каждого СвойстваКартинки Из Строка.Картинки Цикл
				
				РазмерКартинкиМассив = ОбщегоНазначенияСУКлиентСервер.РасщепитьСтроку(СвойстваКартинки.РазмерКартинки, "x");
				
				Если РазмерКартинкиМассив.Количество() <> 2 Тогда
					Продолжить;
				КонецЕсли;
					
				КартинкаXDTO = ФабрикаXDTO.Создать(КартинкаXDTOТип);		
				
				РазмерКартинкиМассив[0] = СокрЛП(РазмерКартинкиМассив[0]);
				РазмерКартинкиМассив[0] = СтрЗаменить(РазмерКартинкиМассив[0], Символ(8234), "");
				РазмерКартинкиМассив[0] = СтрЗаменить(РазмерКартинкиМассив[0], Символ(8236), "");

				РазмерКартинкиМассив[1] = СокрЛП(РазмерКартинкиМассив[1]);
				РазмерКартинкиМассив[1] = СтрЗаменить(РазмерКартинкиМассив[1], Символ(8234), "");
				РазмерКартинкиМассив[1] = СтрЗаменить(РазмерКартинкиМассив[1], Символ(8236), "");				
				
				КартинкаXDTO.Имя    = СвойстваКартинки.Имя;
				КартинкаXDTO.Ширина = Число(РазмерКартинкиМассив[0]);
				КартинкаXDTO.Высота = Число(РазмерКартинкиМассив[1]);
				КартинкаXDTO.Размер = Число(СвойстваКартинки.РазмерФайла);
				
				СерияКартинокXDTO.Картинка.Добавить(КартинкаXDTO);
				
			КонецЦикла;
			
			КартинкиXDTO.СерияКартинок.Добавить(СерияКартинокXDTO);
				
		КонецЦикла;
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, КартинкиXDTO);
		
		ТекстОписания = ТекстОписания + ЗаписьXML.Закрыть();
		
		ТекстОписания = ТекстОписания + Символы.ПС + "<IMAGES}}";
		
	КонецЕсли;	
	
	Возврат ТекстОписания;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОДПИСКА НА СОБЫТИЯ

// Дата изменения

Процедура УстановитьДатуИзмененияПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	

	ДатаИзменения = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ДатаИзменения", ДатаИзменения);
	Если ДатаИзменения = Неопределено Тогда
		ДатаИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
	Источник.ДатаИзменения = ДатаИзменения;

КонецПроцедуры

Процедура УстановитьДатуИзмененияРегистраСУЗПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	Для каждого ЗаписьРегистра Из Источник Цикл
		ЗаписьРегистра.ДатаИзменения = ТекущаяДатаСеанса();
	КонецЦикла;
КонецПроцедуры

// Код

Процедура УстановитьКодКратныйДесятиСУЗПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	ОтменитьУстановкуКода = Ложь;
	ОтменитьУстановкуКода = Источник.ДополнительныеСвойства.Свойство("ОтменитьУстановкуКода");
	
	Если НЕ ОтменитьУстановкуКода Тогда
	
		ИмяСправочника = Источник.Метаданные().Имя;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	"+ИмяСправочника+".Код КАК Код
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
		|ГДЕ
		|	"+ИмяСправочника+".Родитель = &Родитель";
		
		Если Источник.Владелец <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + " И "+ИмяСправочника+".Владелец = &Владелец ";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Родитель", Источник.Родитель); 
		
		Если Источник.Владелец <> Неопределено Тогда
			Запрос.УстановитьПараметр("Владелец", Источник.Владелец); 
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		
		МаксимальныйКод = Результат.Код;
		
		СтандартнаяОбработка = Ложь;
		
		Если МаксимальныйКод = Неопределено Тогда
			Источник.Код = 10;
		Иначе
			Источник.Код = МаксимальныйКод - ОбщегоНазначенияСУКлиентСервер.ОстатокОтДеления(МаксимальныйКод, 10) + 10;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Возможность записи

Процедура ПроверитьВозможностьЗаписиОбъектаСУЗПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;
	
	ОтменитьКонтрольЗаписиОбъекта = Ложь;
	ОтменитьКонтрольЗаписиОбъекта = Источник.ДополнительныеСвойства.Свойство("ОтменитьКонтрольЗаписиОбъекта");
	
	Если НЕ ОтменитьКонтрольЗаписиОбъекта Тогда
		
		ОбъектыСУЗ.ИзменениеДанныхОтПоставщикаЗапрещено(Источник.Поставщик, Отказ);
		
		Если НЕ Отказ И НЕ Источник.ЭтоНовый() Тогда
			
			// Для существующих в базе объектов, которые не могут иметь версии запрещаем изменение поставщика.
			// Группы объектов с версиями так же не имеют версий, но для них проверка не делается.
			Если Источник.Метаданные().Реквизиты.Найти("Версия") = Неопределено Тогда
				ОбъектыСУЗ.ИзменениеДанныхОтПоставщикаЗапрещено(Источник.Ссылка.Поставщик, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьВозможностьЗаписиРегистраСУЗПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;	
	
	ОбъектыСУЗ.ИзменениеДанныхОтПоставщикаЗапрещено(Источник.Отбор.Поставщик.Значение, Отказ);

КонецПроцедуры

// Хранение файлов

Процедура ХранитьФайлыВТомахНаДискеПриЗаписиСУЗПриЗаписи(Источник, Отказ) Экспорт
	Если НЕ Источник.Значение Тогда
		Константы.ХранитьФайлыВидеоВТомахСУЗ.Установить(Ложь);
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ВНЕШНИЕ ПРОГРАММЫ

Функция ДвоичныеДанныеПрограммы(ИмяПрограммы) Экспорт
	
	Возврат Справочники.ФайлыСУЗ.ПолучитьМакет(ИмяПрограммы);
	
КонецФункции
